#+TITLE: SENAITE Installation Documentation
#+AUTHOR: RIDING BYTES GmbH, updated by NiallMurphy-IAEA
#+EMAIL: rb@ridingbytes.com
#+DATE: 2023-03-16
#+SETUPFILE: theme-readtheorg.setup
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,11pt]
#+LATEX_HEADER: \usepackage[left=2cm, right=1.5cm, top=2cm, bottom=1cm]{geometry}
#+LATEX_HEADER: \usepackage[parfill]{parskip}

*** Start NGINX automatically on system boot

    Enable the ~nginx~ service:

    #+begin_src sh :results output verbatim
      systemctl enable nginx
      systemctl start nginx
      systemctl status nginx
    #+end_src

    #+RESULTS:
    #+begin_example
    ● nginx.service - nginx - high performance web server
       Loaded: loaded (/usr/lib/systemd/system/nginx.service; enabled; vendor preset: disabled)
       Active: active (running) since Mon 2021-11-29 16:25:16 CET; 11min ago
         Docs: http://nginx.org/en/docs/
     Main PID: 2033 (nginx)
        Tasks: 3 (limit: 512)
       CGroup: /system.slice/nginx.service
               ├─2033 nginx: master process /usr/sbin/nginx -c /etc/nginx/nginx.c...
               ├─2035 nginx: worker process
               └─2036 nginx: worker process

    Nov 29 16:25:16 senaite systemd[1]: Starting nginx - high performance web s.....
    Nov 29 16:25:16 senaite nginx[1930]: nginx: [warn] "ssl_stapling" ignored, ...t"
    Nov 29 16:25:16 senaite systemd[1]: nginx.service: PID file /var/run/nginx....ry
    Nov 29 16:25:16 senaite systemd[1]: Started nginx - high performance web server.
    Nov 29 16:36:44 senaite systemd[1]: Started nginx - high performance web server.
    Hint: Some lines were ellipsized, use -l to show in full.
    #+end_example


